<?php

return [
    'title' => 'Список изменений',

    'settings' => [
        'webhook' => 'URL-адрес веб-хука Discord',
    ],

    'categories' => [
        'title' => 'Категории',
        'create' => 'Добавить категорию',
        'edit' => 'Изменить категорию',

        'updated' => 'Порядок категорий обновлен.',
    ],

    'updates' => [
        'title' => 'Обновления',
        'create' => 'Добавить обновление',
        'edit' => 'Изменить обновление',
    ],

    'permissions' => [
        'admin' => 'Изменить список изменений',
    ],
];
