<?php

return [
    'nav' => [
        'title' => 'Крамниця',
        'settings' => 'Налаштування',
        'packages' => 'Набори',
        'gateways' => 'Методи оплати',
        'offers' => 'Товари',
        'coupons' => 'Купони',
        'giftcards' => 'Подарункові картки',
        'discounts' => 'Знижки',
        'payments' => 'Платежі',
        'subscriptions' => 'Підписки',
        'variables' => 'Змінні',
        'purchases' => 'Замовлення',
        'statistics' => 'Статистика',
    ],

    'permissions' => [
        'settings' => 'Налаштування магазину',
        'packages' => 'Управління пакунками та категоріями магазину',
        'gateways' => 'Управління платіжними шлюзами магазину',
        'promotions' => 'Управління купонами та знижками магазину',
        'giftcards' => 'Керування подарунковими картками магазину',
        'payments' => 'Створюйте та переглядайте покупки магазину/покупки та підписки',
    ],

    'categories' => [
        'title' => 'Категорії',
        'edit' => 'Редагувати категорію :category',
        'create' => 'Створити категорію',

        'parent' => 'Батьківська категорія',
        'delete_error' => 'Категорія з наборами не може бути видалена.',

        'cumulate' => 'Накопичувальні покупки в цій категорії',
        'cumulate_info' => 'Користувачі, які вже придбали пакет в цій категорії, отримають знижку та оплатять різницю тільки при покупці більш дорогого пакета.',
        'cumulate_strict' => 'Заборонити користувачам купувати дешевші пакети, ніж ті, що вже куплені в цій категорії',
        'single_purchase' => 'Обмеження користувача на покупку одного пакету з цієї категорії',
        'enable' => 'Активувати категорію',
    ],

    'offers' => [
        'title' => 'Товари',
        'edit' => 'Редагувати товар :offer',
        'create' => 'Створити товар',

        'enable' => 'Активувати товар',
    ],

    'coupons' => [
        'title' => 'Купони',
        'edit' => 'Редагувати купон :coupon',
        'create' => 'Створити купон',

        'global' => 'Чи повинен купон діяти для всього магазину?',
        'cumulate' => 'Дозволити використовувати цей купон з іншими купонами',
        'user_limit' => 'Персональний ліміт',
        'global_limit' => 'Глобальний ліміт',
        'active' => 'Активовано',
        'usage' => 'Нижня межа використання',
        'enable' => 'Активувати купон',
    ],

    'giftcards' => [
        'title' => 'Подарункові картки',
        'edit' => 'Редагувати подарункову карту :giftcard',
        'create' => 'Створити подарункові картки',

        'global_limit' => 'Глобальні ліміти',
        'active' => 'Активовано',
        'enable' => 'Включіть також подарункову карту',
        'link' => 'Доступ за посиланням',
        'pending' => 'Оплата в очікуванні, баланс ще не може бути оновлений.',
    ],

    'discounts' => [
        'title' => 'Знижки',
        'edit' => 'Змінити знижку :discount',
        'create' => 'Створити знижку',

        'global' => 'Чи повиннна знижка діяти для всього магазину?',
        'active' => 'Активовано',
        'enable' => 'Активувати знижку',
        'restricted' => 'Обмежити дану знижку тільки обраними ролями',
    ],

    'packages' => [
        'title' => 'Набори',
        'edit' => 'Редагувати пакет :package',
        'create' => 'Створити пакет',

        'every' => 'кожен',
        'after' => 'після',

        'updated' => 'Пакети були оновлені.',

        'variables' => 'Користувацькі змінні',
        'files' => 'Файли для завантаження',
        'role' => 'Роль для встановлення, коли пакет закінчиться',
        'money' => 'Гроші, які будуть зараховані користувачу після покупки',
        'has_giftcard' => 'Створити подарункову карту після покупки та передати її користувачеві',
        'giftcard_balance' => 'Баланс подарункової картки',
        'giftcard_fixed' => 'Фіксована сума',
        'giftcard_dynamic' => 'Ціна пакету',
        'command' => 'Команда не повинна починатися з <code>/</code>. Ви можете використовувати <code>{player}</code> щоб використовувати ім\'я гравця. Для ігор Steam ви також можете використовувати <code>{steam_id}</code> та <code>{steam_id_32}</code>. Іншими доступними заповнювачами є: :placeholders.',
        'has_user_limit' => 'Додати індивідуальний ліміт купівлі для користувача з цього пакету',
        'has_global_limit' => 'Додати глобальний ліміт купівлі для цього пакету',
        'limit_period' => 'Обмеження періоду',
        'limits_no_expired' => 'Виключати вичерпані пакети, коли обчислювати обмеження купівлі',
        'no_period' => 'Період не вказаний',
        'custom_price' => 'Дозволити користувачеві вибрати ціну для оплати (ціна товару буде мінімальною)',
        'enable_quantity' => 'Увімкнути кількість',

        'billing' => 'Тип здійснення оплат',
        'billing_period' => 'Розрахунковий період',
        'one_off' => 'Одноразовий платіж',
        'subscription' => 'Підписка з автоматичним поновленням',
        'subscription_info' => 'Переконайтеся, що ваш платіжний шлюз підтримує підписки. Коли створюється підписка, з користувача буде знято ту ж ціну, поки підписка не буде скасована (будь-яка діюча знижка під час першого платежу буде застосована до наступних платежів).',
        'expiring' => 'Одноразовий платіж з терміном дії',
        'expiring_info' => 'Товар буде автоматично видалено після вказаного періоду.',
        'scheduler' => 'Ви повинні налаштувати завдання CRON для використання підписки, див. <a href="https://azuriom.com/docs/faq" target="_blank" rel="noopener norefferer">FAQ</a> для додаткової інформації.',

        'create_category' => 'Створити категорію',
        'create_package' => 'Створити набір',

        'enable' => 'Активувати цей набір',
    ],

    'commands' => [
        'online' => 'Зачекайте поки гравець буде онлайн перед виконанням команди (потрібно AzLink)',
        'offline' => 'Виконати команду безпосередньо, де гравець в мережі чи ні',
        'servers' => 'Вам потрібно додати принаймні один сервер, щоб створити команду.',

        'trigger' => 'Командний тригер',
        'command' => 'Команда',
        'condition' => 'Умова для виконання команди',

        'triggers' => [
            'purchase' => 'Початкова купівля',
            'expiration' => 'Після завершення',
            'refund' => 'Платіж відшкодовано',
            'chargeback' => 'Повернення коштів',
            'renewal' => 'Оновлення підписки',
        ],
    ],

    'gateways' => [
        'title' => 'Методи оплати',
        'edit' => 'Редагувати шлюз :gateway',
        'create' => 'Додати метод оплати',

        'current' => 'Поточні методи оплати',
        'add' => 'Додати новий метод оплати',
        'info' => 'Якщо у вас виникли проблеми з AzLink при використанні Cloudflare або брандмауер, спробуйте повторити дії в <a href="https://azuriom.com/docs/faq" target="_blank" rel="noopener norefferer">FAQ</a>.',

        'country' => 'Країна',
        'sandbox' => 'Пісочниця',
        'api-key' => 'API ключ',
        'token' => 'Токен доступу',
        'public-key' => 'Публічний ключ',
        'private-key' => 'Приватний ключ',
        'secret-key' => 'Секретний ключ',
        'endpoint-secret' => 'Секрет підписування',
        'service-id' => 'Ідентифікатор сервісу',
        'client-id' => 'Ідентифікатор клієнта',
        'merchant-id' => 'Ідентифікатор продавця',
        'project-id' => 'Ідентифікатор проекту',
        'webhook_id' => 'ID вебхука',
        'website_id' => 'ID веб-сайту',
        'env' => 'Оточення',

        'subscription' => 'Цей платіжний шлюз підтримує автоматичне продовження підписки.',
        'no_subscription' => 'Цей платіжний шлюз не підтримує автоматичне продовження підписки.',

        'paypal_email' => 'Адреса електронної пошти PayPal',
        'paypal_info' => 'Обов’язково введіть <strong>основну</strong> електронну адресу облікового запису PayPal.',
        'paypal_checkout' => 'На інформаційній панелі PayPal у вашому додатку API створіть вебхук з URL-адресою <code>:url</code> та обрати події <code>:events</code>.',
        'stripe_info' => 'На панелі інструментів Stripe вам потрібно встановити URL-адресу вебхука на <code>:url</code> та обрати події: <code>:events</code>.',
        'paymentwall_info' => 'На панелі управління PaymentWall вам необхідно встановити pingback-URL на <code>:url</code>.',
        'xsolla' => 'На панелі управління Xsolla вам необхідно встановити URL-адресу вебхука на <code>:url</code>, дозволити \'Зовнішній ID транзакції\' в налаштуваннях \'Pay station\', перевірити вебхуки і потім увімкнути \'Checkout\' в налаштуваннях \'Pay station\'.',
        'skrill_email' => 'Адреса електронної пошти Skrill',
        'skrill_secret' => 'Секретне слово',
        'skrill_info' => 'Ідентифікатор веб-сайту і секретне слово можна знайти в панелі керування Skrill під пунктом "Налаштування розробника".',
        'mercadopago' => 'Облікові дані Mercado Pago повинні бути для інтеграції з <strong>Checkout Pro</strong>.',

        'enable' => 'Активувати метод оплати',
    ],

    'payments' => [
        'title' => 'Платежі',
        'show' => 'Платіж #:payment',

        'info' => 'Платіжна інформація',
        'items' => 'Придбані товари',

        'card' => 'Платежі в магазині',

        'status' => [
            'pending' => 'Очікування',
            'expired' => 'Термін дії закінчився',
            'chargeback' => 'Повернення коштів',
            'completed' => 'Виконано',
            'refunded' => 'Відшкодовано',
            'error' => 'Помилка',
        ],
    ],

    'purchases' => [
        'title' => 'Замовлення',
    ],

    'subscriptions' => [
        'title' => 'Підписки',
        'show' => 'Підписка #:subscription',

        'info' => 'Інформація про підписку',
        'error' => 'Щоб продовжити, необхідно скасувати пов\'язані підписки і чекати їх закінчення терміну дії.',
        'setup' => 'Пакет підписки можна налаштувати в налаштуваннях пакета, одразу під полем ціни.',

        'status' => [
            'active' => 'Активно',
            'canceled' => 'Скасовано',
            'expired' => 'Сплинув термін дії',
        ],
    ],

    'settings' => [
        'title' => 'Параметри магазину',
        'enable_home' => 'Увімкнути домашню сторінку магазину',
        'home_message' => 'Привітальне повідомлення',
        'use_site_money' => 'Активувати оплату віртуальною валютою сайту.',
        'use_site_money_info' => 'Коли увімкнено, набори в магазині можуть бути придбані лише з коштами веб-сайту. Для того, щоб користувачі сплатили його рахунок, ви можете налаштувати пропозиції в магазині.',
        'webhook' => 'Вебхук Discord',
        'webhook_info' => 'Коли користувач здійснить платіж, він створить сповіщення на цьому вебхуку. Залиш порожнім, щоб вимкнути.',
        'commands' => 'Глобальні команди',
        'recent_payments' => 'Останні платежі дозволені на відображення в бічній панелі (0 для вимкнення)',
        'display_amount' => 'Відображати суму витрат в останніх платежах та найвищих покупців',
        'top_customer' => 'Відображати найкращих клієнтів місяця в бічній панелі',

        'terms_required' => 'Вимагати від користувачів прийняти умови використання перед покупкою',
        'terms' => 'Умови використання',
        'terms_info' => 'Посилання в форматі Markdown, наприклад: <code>я приймаю [умови обслуговування](https://example.com/terms) магазину.</code>',
    ],

    'variables' => [
        'title' => 'Змінні',
        'edit' => 'Редагувати змінну :variable',
        'create' => 'Створити змінну',

        'info' => 'Змінні - це користувацькі поля, які можуть бути додані до пакетів. Вони можуть бути використані для прохання додаткової інформації від користувача під час придбання пакету.',

        'name' => 'Внутрішня назва змінної не може бути змінена після створення.',
        'required' => 'Чи слід використовувати цю змінну?',
        'options' => 'Параметри',

        'text' => 'Текст',
        'number' => 'Номер',
        'email' => 'Електронна пошта',
        'checkbox' => 'Галочка',
        'dropdown' => 'Випадаючий список',
    ],

    'logs' => [
        'shop-gateways' => [
            'created' => 'Додано метод оплати #:id',
            'updated' => 'Оновлено метод оплати #:id',
            'deleted' => 'Видалено метод оплати #:id',
        ],

        'shop-packages' => [
            'created' => 'Набір #:id створено',
            'updated' => 'Набір #:id оновлено',
            'deleted' => 'Набір #:id видалено',
        ],

        'shop-offers' => [
            'created' => 'Товар #:id створено',
            'updated' => 'Товар #:id оновлено',
            'deleted' => 'Товар #:id видалено',
        ],

        'shop-giftcards' => [
            'used' => 'Кількість використань подарункової картки #:id (:amount)',
        ],

        'settings' => 'Оновлено налаштування магазину',
    ],

    'statistics' => [
        'title' => 'Статистика',
        'total' => 'Загалом',
        'recent' => 'Останні платежі',
        'count' => 'Всього замовлень',
        'estimated' => 'Загальний заробіток',
        'month' => 'Замовлень за місяць',
        'month_estimated' => 'Приблизний заробіток у цьому місяці',
    ],

];
