<?php

return [
    'title' => 'Підтримка',

    'categories' => [
        'title' => 'Категорії',
        'edit' => 'Редагувати категорію #:category',
        'create' => 'Створити категорію',

        'delete_empty' => 'Категорія містить тікети і не може бути видалена.',
    ],

    'tickets' => [
        'title' => 'Тікети',
        'show' => 'Тікет #:ticket - :name',
        'create' => 'Створити запит',

        'open' => 'Відкриті тікети',
    ],

    'permissions' => [
        'tickets' => 'Перегляд та керування тікетами',
        'categories' => 'Перегляд та керування категоріями тікетів',
    ],

    'fields' => [
        'title' => 'Поля шаблону квитка',
        'info' => 'Шаблон квитка використовується для визначення полів, які будуть показуватися при створенні квитка замість вільного текстового поля.',
        'required' => 'Це поле обов\'язкове?',
        'options' => 'Параметри',

        'text' => 'Текст',
        'textarea' => 'Область тексту (кілька рядків)',
        'number' => 'Номер',
        'email' => 'Електронна пошта',
        'checkbox' => 'Прапорець',
        'dropdown' => 'Випадаючий список',
    ],

    'settings' => [
        'title' => 'Параметри підтримки',
        'home_message' => 'Привітальне повідомлення',
        'delay' => 'Затримка між двома квитками',
        'webhook' => 'Вебхук Discord',
        'webhook_info' => 'При створенні заявки або доданні коментаря, буде створено повідомлення в цьому вебхуці. Залиште порожнім, щоб вимкнути',
        'scheduler' => 'Коли завдання CRON встановлено, тікети можуть бути автоматично закриті через певний час.',
        'auto_close' => 'Затримка перед автоматичним закриттям тікетів',
        'auto_close_info' => 'Коли тікет не отримав жодної відповіді протягом цього часу, він буде автоматично закритий. Залиште порожнім, щоб відключити.',
        'reopen' => 'Дозволити користувачам знову відкривати закриті тікети.',
    ],

    'logs' => [
        'tickets' => [
            'reopened' => 'Перевідкритий тікет #:id',
            'closed' => 'Закритий запит #:id',
        ],
    ],
];
