<?php

return [
    'title' => 'Список змін',

    'settings' => [
        'webhook' => 'URL-адреса вебхуку Discord',
    ],

    'categories' => [
        'title' => 'Категорії',
        'create' => 'Додати категорію',
        'edit' => 'Змінити категорію',

        'updated' => 'Оновлено порядок категорій.',
    ],

    'updates' => [
        'title' => 'Оновлення',
        'create' => 'Додати оновлення',
        'edit' => 'Редагувати оновлення',
    ],

    'permissions' => [
        'admin' => 'Редагувати список змін',
    ],
];
